src/DataProcessors/РаботаСЗадачами/РаботаСЗадачами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаботаСЗадачами</name>
</mdclass:DataProcessor>

src/InformationRegisters/ОценкаТрудозатратПоЗадачам/ОценкаТрудозатратПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаТрудозатратПоЗадачам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителяЗадачи</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <predefined>
    <items>
      <name>АкцептантСинтаксическогоКонтроля</name>
      <description>Акцептант синтаксического контроля</description>
    </items>
    <items>
      <name>АкцептантФинальногоТестирования</name>
      <description>Акцептант финального тестирования</description>
    </items>
    <items>
      <name>Аналитик</name>
      <description>Аналитик</description>
    </items>
    <items>
      <name>ВедущийПрограммист</name>
      <description>Ведущий программист</description>
    </items>
    <items>
      <name>ВладелецСистемы</name>
      <description>Владелец системы</description>
    </items>
    <items>
      <name>КонтролерДокументации</name>
      <description>Контролер документации</description>
    </items>
    <items>
      <name>Удалить_ПроверкаДокументации</name>
      <description>Проверка документации</description>
    </items>
    <items>
      <name>Удалить_ПроверкаЧасов</name>
      <description>Проверка часов</description>
    </items>
    <items>
      <name>Разработчик</name>
      <description>Разработчик</description>
    </items>
    <items>
      <name>Робот</name>
      <description>Робот</description>
    </items>
    <items>
      <name>РуководительПроектов</name>
      <description>Руководитель проектов</description>
    </items>
    <items>
      <name>СогласующийКонтроляТрудозатрат</name>
      <description>Согласующий контроля трудозатрат</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТехническаяПоддержка</name>
      <description>Техническая поддержка</description>
    </items>
    <items>
      <name>ЭкспертОценкиТрудозатратАналитики</name>
      <description>Эксперт оценки трудозатрат аналитики</description>
    </items>
    <items>
      <name>ЭкспертОценкиТрудозатратРазработки</name>
      <description>Эксперт оценки трудозатрат разработки</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/DataProcessors/РаботаСЗадачами/Forms/ФормаОценкиКонтроляТрудозатрат/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// Форма задачи исполнителя для бизнес процесса КонтрольТрудозатрат
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ЗадачаМетеор = Задачи.ЗадачаИсполнителя.ЗадачаМетеор(Объект.Ссылка);
		РольИсполнителяЗадачи = 
			?(Объект.РольИсполнителя = Справочники.РолиИсполнителей.ЭкспертОценкиТрудозатратРазработки,
				Справочники.РолиИсполнителей.Разработчик,
				Справочники.РолиИсполнителей.Аналитик);
				
		Элементы.ОценкаЧасов.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выполнена(Команда)

	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыполненаНаСервере() Тогда
		
		
		ПоказатьОповещениеПользователя(
			"Выполнение:",
			ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			Строка(Объект.Ссылка),
			БиблиотекаКартинок.Информация32);
		
		ОповеститьОбИзменении(Объект.Ссылка);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполненаНаСервере()
	
	НачатьТранзакцию();
	
	// Запись оценки необходимо выполнять до "выполнения" задачи,
	// т.к. переход по карте маршрута идёт в транзакции после выполнения, но до события "ПриЗаписиНаСервере"
	Менеджер = РегистрыСведений.ОценкаТрудозатратПоЗадачам.СоздатьМенеджерЗаписи();
	Менеджер.ЗадачаМетеор = ЗадачаМетеор;
	Менеджер.РольИсполнителяЗадачи = РольИсполнителяЗадачи;
	Менеджер.Количество = ОценкаЧасов;
	Менеджер.Ответственный = Пользователи.ТекущийПользователь();
	Менеджер.Дата = ТекущаяДатаСеанса();
	Менеджер.Записать();
	
	Выполнена = Записать(Новый Структура("ВыполнитьЗадачу", Истина));
	
	ЗафиксироватьТранзакцию();
	
	Возврат Выполнена;
	
КонецФункции


#КонецОбласти
